openfoam/test_cases/cylinder2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          5.0e-5;

writeControl    runTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;


functions
{
    // function object for computing the states and actions in order to predict the solver settings for GAMG
    residuals
        {
            type            agentSolverSettings;
            libs            ("${DRL_LIBBIN}/libAgentSolverSettings.so");
            timeStart       0;
            fields          (p);
            policy          "policy.pt";
            train           true;
            seed            0;
    }

    // log the execution time per time step for reward function
    time
    {
        type            timeInfo;
        libs            (utilityFunctionObjects);
        timeStart       0;
        perTimeStep     yes;
    }

    forces
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;
        log false;

        patches
        (
            cylinder
        );

        rhoInf      1;
        rho         rhoInf;

        CofR        (0.2 0.2 0.005);
        liftDir     (0 1 0);
        dragDir     (1 0 0);
        //pitchAxis   (0 0 1);
        magUInf     1.0;
        lRef        0.1;
        Aref        0.001;
    }

    probes
        {
            type            probes;
            libs            (sampling);
            name            probes;
            writeControl    timeStep;
            writeInterval   1;
            startTime       0.0;
            fields          (p);
            fixedLocations  true;
            interpolationScheme cell;

        probeLocations
        (
            (0.3 0.15 0.005)
            (0.3 0.2 0.005)
            (0.3 0.25 0.005)
            (0.4 0.15 0.005)
            (0.4 0.2 0.005)
            (0.4 0.25 0.005)
            (0.5 0.15 0.005)
            (0.5 0.2 0.005)
            (0.5 0.25 0.005)
            (0.6 0.15 0.005)
            (0.6 0.2 0.005)
            (0.6 0.25 0.005)
        );
        includeOutOfBounds  false;
    }

}

// ************************************************************************* //
