openfoam/test_cases/cylinder2D/Allrun
#!/bin/bash
cd "${0%/*}" || exit
. ${DRL_BASE:?}/openfoam/RunFunctions
#------------------------------------------------------------------------------

# run case
runParallel pimpleFoam
